/**
 * @文件名称: FilterType.java
 * @类路径:   com.rb.lottery.domain
 * @描述:     TODO
 * @作者:     robin
 * @时间:     2011-11-24 下午01:22:20
 * @版本:     1.0.0
 */
package com.rb.lottery.domain;


/**
 * @类功能说明:过滤条件 
 * @类修改者:     
 * @修改日期:   
 * @修改说明:   
 * @作者:       robin
 * @创建时间:   2011-11-24 下午01:22:20
 * @版本:       1.0.0
 */

public enum FilterType {

	// common filter A
	胜场数,
	
	平场数,
	
	负场数,
	
	积分和,
	
	断点数,
	
	连号个数,
	
	主场连胜,
	
	主场连平,
	
	主场连负,
	
	胜平连号,
	
	胜负连号,
	
	平负连号,
	
	邻号间距和,
	
	邻号乘积和,
	
	号码位积和,
	
	// common filter B
	第一赔率,
	
	第二赔率,
	
	第三赔率,
	
	区间排名,
	
	概率积,
	
	值博率,
	
	概率和,
	
	赔率和,
	
	赔率积,
	
	奖金指数
}
